ОптоваяТорговля/src/Documents/СписаниеСРасчетногоСчета/СписаниеСРасчетногоСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеСРасчетногоСчета</name>
  <registerRecords>AccumulationRegister.АвансыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженостьПередПоставщиками</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

ОптоваяТорговля/src/AccumulationRegisters/ЗадолженостьПередПоставщиками/ЗадолженостьПередПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗадолженостьПередПоставщиками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ОптоваяТорговля/src/AccumulationRegisters/АвансыПоставщикам/АвансыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АвансыПоставщикам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ОптоваяТорговля/src/Documents/СписаниеСРасчетногоСчета/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	СформироватьДвиженияВзаиморасчетыСПоставщиками();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияВзаиморасчетыСПоставщиками()
	
	Движения.ЗадолженостьПередПоставщиками.Очистить();
	Движения.АвансыПоставщикам.Очистить();
	
	Движения.ЗадолженостьПередПоставщиками.Записывать = Истина;
	Движения.АвансыПоставщикам.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадолженостьПередПоставщикамиОстатки.СуммаОстаток КАК Долг
		|ИЗ
		|	РегистрНакопления.ЗадолженостьПередПоставщиками.Остатки(
		|			&Период,
		|			Контрагент = &Контрагент
		|				И Договор = &Договор) КАК ЗадолженостьПередПоставщикамиОстатки";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Долг = 0;
	
	Если РезультатЗапроса.Следующий() Тогда
		Долг = РезультатЗапроса.Долг;
	КонецЕсли;
	
	Если Сумма <= Долг Тогда
		
		Движение = Движения.ЗадолженостьПередПоставщиками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Договор = Договор;
		Движение.Контрагент = Контрагент;
		Движение.Сумма = Сумма;
		
	Иначе
		
		Если Долг > 0 Тогда
			
			Движение = Движения.ЗадолженостьПередПоставщиками.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Договор = Договор;
			Движение.Контрагент = Контрагент;
			Движение.Сумма = Сумма;
			
		КонецЕсли;
		
		ОстатокАванса = Сумма - Долг;
		
		Если ОстатокАванса > 0 Тогда
			
			Движение = Движения.АвансыПоставщикам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Договор = Договор;
			Движение.Контрагент = Контрагент;
			Движение.Сумма = Сумма;
			
			
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
